research/visualization_methods/outputs/Bayesian Linear Regression__partially_pooled/partially_pooled.dot
digraph G {
  "Dict" [label="Dict"];
  "FVC_est" [label="FVC_est"];
  "FVC_obs" [label="FVC_obs"];
  "FVC_predict" [label="FVC_predict"];
  "FVC_predicted" [label="FVC_predicted"];
  "Gamma" [label="Gamma"];
  "KeepLast" [label="KeepLast"];
  "Normal" [label="Normal"];
  "NormalMeanVariance" [label="NormalMeanVariance"];
  "a" [label="a"];
  "abs" [label="abs"];
  "b" [label="b"];
  "c" [label="c"];
  "code" [label="code"];
  "color" [label="color"];
  "constraints" [label="constraints"];
  "d" [label="d"];
  "data" [label="data"];
  "dataset" [label="dataset"];
  "delta" [label="delta"];
  "estimated_σ" [label="estimated_σ"];
  "false" [label="false"];
  "fill" [label="fill"];
  "fillalpha" [label="fillalpha"];
  "first" [label="first"];
  "getindex" [label="getindex"];
  "i" [label="i"];
  "id" [label="id"];
  "info" [label="info"];
  "inv" [label="inv"];
  "label" [label="label"];
  "layout" [label="layout"];
  "legend" [label="legend"];
  "length" [label="length"];
  "local p1" [label="local p1"];
  "local p2" [label="local p2"];
  "local p3" [label="local p3"];
  "local p4" [label="local p4"];
  "local p5" [label="local p5"];
  "local p6" [label="local p6"];
  "local α" [label="local α"];
  "local αsmoking" [label="local αsmoking"];
  "local β" [label="local β"];
  "local βsmoking" [label="local βsmoking"];
  "local μ_α" [label="local μ_α"];
  "local μ_β" [label="local μ_β"];
  "map" [label="map"];
  "mean" [label="mean"];
  "model" [label="model"];
  "n_codes" [label="n_codes"];
  "n_patients" [label="n_patients"];
  "n_smoking_statuses" [label="n_smoking_statuses"];
  "p" [label="p"];
  "p1" [label="p1"];
  "p2" [label="p2"];
  "p3" [label="p3"];
  "partially_pooled" [label="partially_pooled"];
  "partially_pooled_constraints" [label="partially_pooled_constraints"];
  "partially_pooled_inference" [label="partially_pooled_inference"];
  "partially_pooled_inference_results" [label="partially_pooled_inference_results"];
  "partially_pooled_with_smoking" [label="partially_pooled_with_smoking"];
  "partially_pooled_with_smoking_inference_results" [label="partially_pooled_with_smoking_inference_results"];
  "partially_pooled_with_smooking_constraints" [label="partially_pooled_with_smooking_constraints"];
  "patient" [label="patient"];
  "patient_code_column" [label="patient_code_column"];
  "patient_code_encoder" [label="patient_code_encoder"];
  "patient_codes" [label="patient_codes"];
  "patient_id" [label="patient_id"];
  "patient_ids" [label="patient_ids"];
  "patient_α" [label="patient_α"];
  "patientchart" [label="patientchart"];
  "patientchart_bayesian" [label="patientchart_bayesian"];
  "patientinfo" [label="patientinfo"];
  "plot" [label="plot"];
  "plot(p1, p2, p3, layout" [label="plot(p1, p2, p3, layout"];
  "pm" [label="pm"];
  "precision" [label="precision"];
  "predict_weeks" [label="predict_weeks"];
  "predicted" [label="predicted"];
  "pv" [label="pv"];
  "q" [label="q"];
  "q(FVC_est, σ)" [label="q(FVC_est, σ)"];
  "q(α)" [label="q(α)"];
  "q(β)" [label="q(β)"];
  "q(μ_α, σ_α, α)" [label="q(μ_α, σ_α, α)"];
  "q(μ_α, σ_α, μ_β, σ_β, σ)" [label="q(μ_α, σ_α, μ_β, σ_β, σ)"];
  "q(μ_α_global, σ_α_global, α)" [label="q(μ_α_global, σ_α_global, α)"];
  "q(μ_α_global, σ_α_global, μ_β_global, σ_β_global)" [label="q(μ_α_global, σ_α_global, μ_β_global, σ_β_global)"];
  "q(μ_α_global, σ_α_global, μ_β_global, σ_β_global, σ)" [label="q(μ_α_global, σ_α_global, μ_β_global, σ_β_global, σ)"];
  "q(μ_α_smoking_status, μ_β_smoking_status, σ_α_global, σ_β_global)" [label="q(μ_α_smoking_status, μ_β_smoking_status, σ_α_global, σ_β_global)"];
  "q(μ_β, σ_β, β)" [label="q(μ_β, σ_β, β)"];
  "q(μ_β_global, σ_β_global, β)" [label="q(μ_β_global, σ_β_global, β)"];
  "q(σ)" [label="q(σ)"];
  "q(σ_α)" [label="q(σ_α)"];
  "q(σ_α_global)" [label="q(σ_α_global)"];
  "q(σ_β)" [label="q(σ_β)"];
  "q(σ_β_global)" [label="q(σ_β_global)"];
  "range" [label="range"];
  "results" [label="results"];
  "return plot!(p, predict_weeks, getindex_(predicted, 1), ribbon" [label="return plot!(p, predict_weeks, getindex.(predicted, 1), ribbon"];
  "returnvars" [label="returnvars"];
  "scale" [label="scale"];
  "shape" [label="shape"];
  "sigma_c" [label="sigma_c"];
  "size" [label="size"];
  "smoking_code_encoder" [label="smoking_code_encoder"];
  "smoking_id_mapping" [label="smoking_id_mapping"];
  "smoking_status" [label="smoking_status"];
  "smoking_status_patient_mapping" [label="smoking_status_patient_mapping"];
  "std" [label="std"];
  "title" [label="title"];
  "vague" [label="vague"];
  "values" [label="values"];
  "var" [label="var"];
  "weeks" [label="weeks"];
  "α" [label="α"];
  "β" [label="β"];
  "μ(α)" [label="μ(α)"];
  "μ(β)" [label="μ(β)"];
  "μ_α" [label="μ_α"];
  "μ_α_global" [label="μ_α_global"];
  "μ_α_smoking_status" [label="μ_α_smoking_status"];
  "μ_β" [label="μ_β"];
  "μ_β_global" [label="μ_β_global"];
  "μ_β_smoking_status" [label="μ_β_smoking_status"];
  "σ" [label="σ"];
  "σ_α" [label="σ_α"];
  "σ_α_global" [label="σ_α_global"];
  "σ_β" [label="σ_β"];
  "σ_β_global" [label="σ_β_global"];
  "Dict" -> "patient_code_encoder";
  "Dict" -> "smoking_code_encoder";
  "Dict" -> "smoking_id_mapping";
  "FVC_est" -> "data";
  "FVC_predict" -> "FVC_predicted";
  "FVC_predicted" -> "sigma_c";
  "Gamma" -> "q(σ)";
  "Gamma" -> "q(σ_α)";
  "Gamma" -> "q(σ_α_global)";
  "Gamma" -> "q(σ_β)";
  "Gamma" -> "q(σ_β_global)";
  "Gamma" -> "σ";
  "Gamma" -> "σ_α";
  "Gamma" -> "σ_α_global";
  "Gamma" -> "σ_β";
  "Gamma" -> "σ_β_global";
  "KeepLast" -> "returnvars";
  "Normal" -> "data";
  "Normal" -> "local μ_α";
  "Normal" -> "local μ_β";
  "Normal" -> "α";
  "Normal" -> "β";
  "Normal" -> "μ_α";
  "Normal" -> "μ_α_global";
  "Normal" -> "μ_α_smoking_status";
  "Normal" -> "μ_β";
  "Normal" -> "μ_β_global";
  "Normal" -> "μ_β_smoking_status";
  "NormalMeanVariance" -> "q(α)";
  "NormalMeanVariance" -> "q(β)";
  "NormalMeanVariance" -> "μ(α)";
  "NormalMeanVariance" -> "μ(β)";
  "a" -> "plot(p1, p2, p3, layout";
  "abs" -> "delta";
  "b" -> "plot(p1, p2, p3, layout";
  "c" -> "plot(p1, p2, p3, layout";
  "code" -> "smoking_id_mapping";
  "color" -> "return plot!(p, predict_weeks, getindex_(predicted, 1), ribbon";
  "d" -> "local α";
  "d" -> "local αsmoking";
  "d" -> "local β";
  "d" -> "local βsmoking";
  "dataset" -> "FVC_obs";
  "dataset" -> "delta";
  "dataset" -> "info";
  "dataset" -> "p";
  "dataset" -> "p1";
  "dataset" -> "p2";
  "dataset" -> "p3";
  "dataset" -> "partially_pooled_inference_results";
  "dataset" -> "partially_pooled_with_smoking_inference_results";
  "dataset" -> "patient_codes";
  "dataset" -> "weeks";
  "false" -> "local p1";
  "false" -> "local p2";
  "false" -> "local p3";
  "false" -> "local p4";
  "false" -> "local p5";
  "false" -> "local p6";
  "fill" -> "local p1";
  "fill" -> "local p2";
  "fillalpha" -> "local p1";
  "fillalpha" -> "local p2";
  "first" -> "smoking_status";
  "getindex" -> "return plot!(p, predict_weeks, getindex_(predicted, 1), ribbon";
  "i" -> "data";
  "i" -> "α";
  "i" -> "β";
  "id" -> "smoking_status_patient_mapping";
  "inv" -> "estimated_σ";
  "label" -> "local p1";
  "label" -> "local p2";
  "layout" -> "plot(p1, p2, p3, layout";
  "legend" -> "local p3";
  "legend" -> "local p4";
  "legend" -> "local p5";
  "legend" -> "local p6";
  "length" -> "n_codes";
  "length" -> "n_patients";
  "length" -> "n_smoking_statuses";
  "map" -> "local α";
  "map" -> "local αsmoking";
  "map" -> "local β";
  "map" -> "local βsmoking";
  "map" -> "patient_code_column";
  "map" -> "predicted";
  "map" -> "smoking_status_patient_mapping";
  "mean" -> "data";
  "mean" -> "pm";
  "mean" -> "α";
  "mean" -> "β";
  "mean" -> "μ_α";
  "mean" -> "μ_α_global";
  "mean" -> "μ_α_smoking_status";
  "mean" -> "μ_β";
  "mean" -> "μ_β_global";
  "mean" -> "μ_β_smoking_status";
  "partially_pooled" -> "model";
  "partially_pooled_constraints" -> "constraints";
  "partially_pooled_inference" -> "partially_pooled_inference_results";
  "partially_pooled_inference_results" -> "p1";
  "partially_pooled_inference_results" -> "p2";
  "partially_pooled_inference_results" -> "p3";
  "partially_pooled_with_smoking" -> "partially_pooled_with_smoking_inference_results";
  "partially_pooled_with_smoking_inference_results" -> "p1";
  "partially_pooled_with_smoking_inference_results" -> "p2";
  "partially_pooled_with_smoking_inference_results" -> "p3";
  "partially_pooled_with_smooking_constraints" -> "constraints";
  "patient" -> "patient_code_column";
  "patient" -> "patient_code_encoder";
  "patient_code_encoder" -> "p1";
  "patient_code_encoder" -> "p2";
  "patient_code_encoder" -> "p3";
  "patient_code_encoder" -> "patient_code_column";
  "patient_codes" -> "model";
  "patient_codes" -> "n_codes";
  "patient_id" -> "info";
  "patient_id" -> "p";
  "patient_id" -> "smoking_status";
  "patient_ids" -> "patient_code_column";
  "patient_α" -> "pm";
  "patient_α" -> "pv";
  "patientchart" -> "p";
  "patientchart_bayesian" -> "p1";
  "patientchart_bayesian" -> "p2";
  "patientchart_bayesian" -> "p3";
  "patientinfo" -> "info";
  "plot" -> "local p1";
  "plot" -> "local p2";
  "plot" -> "local p3";
  "plot" -> "local p4";
  "plot" -> "local p5";
  "plot" -> "local p6";
  "precision" -> "data";
  "precision" -> "α";
  "precision" -> "β";
  "precision" -> "μ_α_smoking_status";
  "precision" -> "μ_β_smoking_status";
  "predict_weeks" -> "predicted";
  "predicted" -> "return plot!(p, predict_weeks, getindex_(predicted, 1), ribbon";
  "q" -> "q(FVC_est, σ)";
  "q" -> "q(μ_α, σ_α, α)";
  "q" -> "q(μ_α, σ_α, μ_β, σ_β, σ)";
  "q" -> "q(μ_α_global, σ_α_global, α)";
  "q" -> "q(μ_α_global, σ_α_global, μ_β_global, σ_β_global)";
  "q" -> "q(μ_α_global, σ_α_global, μ_β_global, σ_β_global, σ)";
  "q" -> "q(μ_α_smoking_status, μ_β_smoking_status, σ_α_global, σ_β_global)";
  "q" -> "q(μ_β, σ_β, β)";
  "q" -> "q(μ_β_global, σ_β_global, β)";
  "range" -> "predict_weeks";
  "results" -> "FVC_predicted";
  "scale" -> "σ";
  "scale" -> "σ_α";
  "scale" -> "σ_α_global";
  "scale" -> "σ_β";
  "scale" -> "σ_β_global";
  "shape" -> "σ";
  "shape" -> "σ_α";
  "shape" -> "σ_α_global";
  "shape" -> "σ_β";
  "shape" -> "σ_β_global";
  "size" -> "plot(p1, p2, p3, layout";
  "smoking_code_encoder" -> "smoking_status_patient_mapping";
  "smoking_status" -> "smoking_id_mapping";
  "smoking_status_patient_mapping" -> "partially_pooled_with_smoking_inference_results";
  "smoking_status_patient_mapping" -> "α";
  "smoking_status_patient_mapping" -> "β";
  "std" -> "sigma_c";
  "title" -> "local p1";
  "title" -> "local p2";
  "title" -> "local p3";
  "title" -> "local p4";
  "title" -> "local p5";
  "title" -> "local p6";
  "vague" -> "q(α)";
  "vague" -> "q(β)";
  "vague" -> "q(σ)";
  "vague" -> "q(σ_α)";
  "vague" -> "q(σ_β)";
  "vague" -> "μ(α)";
  "vague" -> "μ(β)";
  "values" -> "FVC_obs";
  "values" -> "patient_codes";
  "values" -> "weeks";
  "var" -> "pv";
  "var" -> "μ_α";
  "var" -> "μ_α_global";
  "var" -> "μ_β";
  "var" -> "μ_β_global";
  "weeks" -> "model";
  "μ_α" -> "local p1";
  "μ_α" -> "q(μ_α, σ_α, α)";
  "μ_α" -> "α";
  "μ_α_global" -> "q(μ_α_global, σ_α_global, α)";
  "μ_α_global" -> "μ_α_smoking_status";
  "μ_α_smoking_status" -> "α";
  "μ_β" -> "local p2";
  "μ_β" -> "q(μ_β, σ_β, β)";
  "μ_β" -> "β";
  "μ_β_global" -> "q(μ_β_global, σ_β_global, β)";
  "μ_β_global" -> "μ_β_smoking_status";
  "μ_β_smoking_status" -> "β";
  "σ" -> "data";
  "σ_α" -> "α";
  "σ_α_global" -> "α";
  "σ_α_global" -> "μ_α_smoking_status";
  "σ_β" -> "β";
  "σ_β_global" -> "β";
  "σ_β_global" -> "μ_β_smoking_status";
}
